zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_F16ASM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_F16ASM.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_F16ASM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_F16ASM_H_)  /* Check if memory map has not been already included */
#define S32K566_F16ASM_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- F16ASM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup F16ASM_Peripheral_Access_Layer F16ASM Peripheral Access Layer
 * @{
 */

/** F16ASM - Size of Registers Arrays */
#define F16ASM_UMISR08_COUNT                      9u
#define F16ASM_UD07_COUNT                         8u
#define F16ASM_UD916_COUNT                        8u

/** F16ASM - Register Layout Typedef */
typedef struct F16ASM_Struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  __IO uint32_t MCRS;                              /**< Module Configuration Status, offset: 0x4 */
  uint8_t RESERVED_0[4];
  __IO uint32_t RADR;                              /**< Read Address Logging, offset: 0xC */
  __I  uint32_t WADR;                              /**< Write Address Logging, offset: 0x10 */
  __I  uint32_t LOCK0;                             /**< Partition Lock 0, offset: 0x14 */
  __I  uint32_t LOCK1;                             /**< Partition Lock 1, offset: 0x18 */
  __IO uint32_t UT0;                               /**< UTest 0, offset: 0x1C */
  __IO uint32_t UMISR[F16ASM_UMISR08_COUNT];       /**< UTest Multiple Input Signature 0..UTest Multiple Input Signature 8, array offset: 0x20, array step: 0x4 */
  __IO uint32_t UMISR9;                            /**< UTest Multiple Input Signature 9, offset: 0x44 */
  __IO uint32_t UD_0_TO_7[F16ASM_UD07_COUNT];      /**< UTest Data 0..UTest Data 7, array offset: 0x48, array step: 0x4 */
  __IO uint32_t UD8;                               /**< UTest Data 8, offset: 0x68 */
  __IO uint32_t UD_9_TO_16[F16ASM_UD916_COUNT];    /**< UTest Data 9..UTest Data 16, array offset: 0x6C, array step: 0x4 */
  __IO uint32_t UD17;                              /**< UTest Data 17, offset: 0x8C */
  uint8_t RESERVED_1[4];
  __IO uint32_t UA0;                               /**< UTest Address 0, offset: 0x94 */
  __IO uint32_t UA1;                               /**< UTest Address 1, offset: 0x98 */
} F16ASM_Type, *F16ASM_MemMapPtr;

/** Number of instances of the F16ASM module. */
#define F16ASM_INSTANCE_COUNT                    (1u)

/* F16ASM - Peripheral instance base addresses */
/** Peripheral MRAM base address */
#define IP_MRAM_BASE                             (0x404A0000u)
/** Peripheral MRAM base pointer */
#define IP_MRAM                                  ((F16ASM_Type *)IP_MRAM_BASE)
/** Array initializer of F16ASM peripheral base addresses */
#define IP_F16ASM_BASE_ADDRS                     { IP_MRAM_BASE }
/** Array initializer of F16ASM peripheral base pointers */
#define IP_F16ASM_BASE_PTRS                      { IP_MRAM }

/* ----------------------------------------------------------------------------
   -- F16ASM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup F16ASM_Register_Masks F16ASM Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define F16ASM_MCR_RWSC_MASK                     (0xFU)
#define F16ASM_MCR_RWSC_SHIFT                    (0U)
#define F16ASM_MCR_RWSC_WIDTH                    (4U)
#define F16ASM_MCR_RWSC(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCR_RWSC_SHIFT)) & F16ASM_MCR_RWSC_MASK)

#define F16ASM_MCR_RWSL_MASK                     (0x80U)
#define F16ASM_MCR_RWSL_SHIFT                    (7U)
#define F16ASM_MCR_RWSL_WIDTH                    (1U)
#define F16ASM_MCR_RWSL(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCR_RWSL_SHIFT)) & F16ASM_MCR_RWSL_MASK)

#define F16ASM_MCR_WPL_MASK                      (0x8000000U)
#define F16ASM_MCR_WPL_SHIFT                     (27U)
#define F16ASM_MCR_WPL_WIDTH                     (1U)
#define F16ASM_MCR_WPL(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_MCR_WPL_SHIFT)) & F16ASM_MCR_WPL_MASK)

#define F16ASM_MCR_CVE_MASK                      (0x20000000U)
#define F16ASM_MCR_CVE_SHIFT                     (29U)
#define F16ASM_MCR_CVE_WIDTH                     (1U)
#define F16ASM_MCR_CVE(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_MCR_CVE_SHIFT)) & F16ASM_MCR_CVE_MASK)

#define F16ASM_MCR_OWC_MASK                      (0x80000000U)
#define F16ASM_MCR_OWC_SHIFT                     (31U)
#define F16ASM_MCR_OWC_WIDTH                     (1U)
#define F16ASM_MCR_OWC(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_MCR_OWC_SHIFT)) & F16ASM_MCR_OWC_MASK)
/*! @} */

/*! @name MCRS - Module Configuration Status */
/*! @{ */

