zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_F16ASM.h
#define F16ASM_MCRS_SIZE_MASK                    (0xFU)
#define F16ASM_MCRS_SIZE_SHIFT                   (0U)
#define F16ASM_MCRS_SIZE_WIDTH                   (4U)
#define F16ASM_MCRS_SIZE(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_SIZE_SHIFT)) & F16ASM_MCRS_SIZE_MASK)

#define F16ASM_MCRS_SSIZE_MASK                   (0x30U)
#define F16ASM_MCRS_SSIZE_SHIFT                  (4U)
#define F16ASM_MCRS_SSIZE_WIDTH                  (2U)
#define F16ASM_MCRS_SSIZE(x)                     (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_SSIZE_SHIFT)) & F16ASM_MCRS_SSIZE_MASK)

#define F16ASM_MCRS_OMR_MASK                     (0x100U)
#define F16ASM_MCRS_OMR_SHIFT                    (8U)
#define F16ASM_MCRS_OMR_WIDTH                    (1U)
#define F16ASM_MCRS_OMR(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_OMR_SHIFT)) & F16ASM_MCRS_OMR_MASK)

#define F16ASM_MCRS_OMA_MASK                     (0x200U)
#define F16ASM_MCRS_OMA_SHIFT                    (9U)
#define F16ASM_MCRS_OMA_WIDTH                    (1U)
#define F16ASM_MCRS_OMA(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_OMA_SHIFT)) & F16ASM_MCRS_OMA_MASK)

#define F16ASM_MCRS_LPR_MASK                     (0x400U)
#define F16ASM_MCRS_LPR_SHIFT                    (10U)
#define F16ASM_MCRS_LPR_WIDTH                    (1U)
#define F16ASM_MCRS_LPR(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_LPR_SHIFT)) & F16ASM_MCRS_LPR_MASK)

#define F16ASM_MCRS_LPA_MASK                     (0x800U)
#define F16ASM_MCRS_LPA_SHIFT                    (11U)
#define F16ASM_MCRS_LPA_WIDTH                    (1U)
#define F16ASM_MCRS_LPA(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_LPA_SHIFT)) & F16ASM_MCRS_LPA_MASK)

#define F16ASM_MCRS_REWSC_MASK                   (0xF000U)
#define F16ASM_MCRS_REWSC_SHIFT                  (12U)
#define F16ASM_MCRS_REWSC_WIDTH                  (4U)
#define F16ASM_MCRS_REWSC(x)                     (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_REWSC_SHIFT)) & F16ASM_MCRS_REWSC_MASK)

#define F16ASM_MCRS_DONE_MASK                    (0x10000U)
#define F16ASM_MCRS_DONE_SHIFT                   (16U)
#define F16ASM_MCRS_DONE_WIDTH                   (1U)
#define F16ASM_MCRS_DONE(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_DONE_SHIFT)) & F16ASM_MCRS_DONE_MASK)

#define F16ASM_MCRS_RSE_MASK                     (0x40000U)
#define F16ASM_MCRS_RSE_SHIFT                    (18U)
#define F16ASM_MCRS_RSE_WIDTH                    (1U)
#define F16ASM_MCRS_RSE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_RSE_SHIFT)) & F16ASM_MCRS_RSE_MASK)

#define F16ASM_MCRS_WTE_MASK                     (0x80000U)
#define F16ASM_MCRS_WTE_SHIFT                    (19U)
#define F16ASM_MCRS_WTE_WIDTH                    (1U)
#define F16ASM_MCRS_WTE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_WTE_SHIFT)) & F16ASM_MCRS_WTE_MASK)

#define F16ASM_MCRS_WAE_MASK                     (0x100000U)
#define F16ASM_MCRS_WAE_SHIFT                    (20U)
#define F16ASM_MCRS_WAE_WIDTH                    (1U)
#define F16ASM_MCRS_WAE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_WAE_SHIFT)) & F16ASM_MCRS_WAE_MASK)

#define F16ASM_MCRS_WRP_MASK                     (0x200000U)
#define F16ASM_MCRS_WRP_SHIFT                    (21U)
#define F16ASM_MCRS_WRP_WIDTH                    (1U)
#define F16ASM_MCRS_WRP(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_WRP_SHIFT)) & F16ASM_MCRS_WRP_MASK)

#define F16ASM_MCRS_WCE_MASK                     (0x400000U)
#define F16ASM_MCRS_WCE_SHIFT                    (22U)
#define F16ASM_MCRS_WCE_WIDTH                    (1U)
#define F16ASM_MCRS_WCE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_WCE_SHIFT)) & F16ASM_MCRS_WCE_MASK)

#define F16ASM_MCRS_WRE_MASK                     (0x800000U)
#define F16ASM_MCRS_WRE_SHIFT                    (23U)
#define F16ASM_MCRS_WRE_WIDTH                    (1U)
#define F16ASM_MCRS_WRE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_WRE_SHIFT)) & F16ASM_MCRS_WRE_MASK)

#define F16ASM_MCRS_RE_MASK                      (0x1000000U)
#define F16ASM_MCRS_RE_SHIFT                     (24U)
#define F16ASM_MCRS_RE_WIDTH                     (1U)
#define F16ASM_MCRS_RE(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_RE_SHIFT)) & F16ASM_MCRS_RE_MASK)

#define F16ASM_MCRS_EEE_MASK                     (0x2000000U)
#define F16ASM_MCRS_EEE_SHIFT                    (25U)
#define F16ASM_MCRS_EEE_WIDTH                    (1U)
#define F16ASM_MCRS_EEE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_EEE_SHIFT)) & F16ASM_MCRS_EEE_MASK)

#define F16ASM_MCRS_AEE_MASK                     (0x4000000U)
#define F16ASM_MCRS_AEE_SHIFT                    (26U)
#define F16ASM_MCRS_AEE_WIDTH                    (1U)
#define F16ASM_MCRS_AEE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_AEE_SHIFT)) & F16ASM_MCRS_AEE_MASK)

#define F16ASM_MCRS_SBC_MASK                     (0x10000000U)
#define F16ASM_MCRS_SBC_SHIFT                    (28U)
#define F16ASM_MCRS_SBC_WIDTH                    (1U)
#define F16ASM_MCRS_SBC(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_SBC_SHIFT)) & F16ASM_MCRS_SBC_MASK)

#define F16ASM_MCRS_DBC_MASK                     (0x20000000U)
#define F16ASM_MCRS_DBC_SHIFT                    (29U)
#define F16ASM_MCRS_DBC_WIDTH                    (1U)
#define F16ASM_MCRS_DBC(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_DBC_SHIFT)) & F16ASM_MCRS_DBC_MASK)

#define F16ASM_MCRS_TBC_MASK                     (0x40000000U)
#define F16ASM_MCRS_TBC_SHIFT                    (30U)
#define F16ASM_MCRS_TBC_WIDTH                    (1U)
#define F16ASM_MCRS_TBC(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_TBC_SHIFT)) & F16ASM_MCRS_TBC_MASK)

#define F16ASM_MCRS_EER_MASK                     (0x80000000U)
#define F16ASM_MCRS_EER_SHIFT                    (31U)
#define F16ASM_MCRS_EER_WIDTH                    (1U)
#define F16ASM_MCRS_EER(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_MCRS_EER_SHIFT)) & F16ASM_MCRS_EER_MASK)
/*! @} */

/*! @name RADR - Read Address Logging */
/*! @{ */

#define F16ASM_RADR_RADDR_MASK                   (0x1FFFFE0U)
#define F16ASM_RADR_RADDR_SHIFT                  (5U)
#define F16ASM_RADR_RADDR_WIDTH                  (20U)
#define F16ASM_RADR_RADDR(x)                     (((uint32_t)(((uint32_t)(x)) << F16ASM_RADR_RADDR_SHIFT)) & F16ASM_RADR_RADDR_MASK)

#define F16ASM_RADR_RUL_MASK                     (0x2000000U)
#define F16ASM_RADR_RUL_SHIFT                    (25U)
#define F16ASM_RADR_RUL_WIDTH                    (1U)
#define F16ASM_RADR_RUL(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_RADR_RUL_SHIFT)) & F16ASM_RADR_RUL_MASK)

