zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_F16ASM.h
#define F16ASM_RADR_SPR_MASK                     (0x4000000U)
#define F16ASM_RADR_SPR_SHIFT                    (26U)
#define F16ASM_RADR_SPR_WIDTH                    (1U)
#define F16ASM_RADR_SPR(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_RADR_SPR_SHIFT)) & F16ASM_RADR_SPR_MASK)

#define F16ASM_RADR_OTPR_MASK                    (0x8000000U)
#define F16ASM_RADR_OTPR_SHIFT                   (27U)
#define F16ASM_RADR_OTPR_WIDTH                   (1U)
#define F16ASM_RADR_OTPR(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_RADR_OTPR_SHIFT)) & F16ASM_RADR_OTPR_MASK)

#define F16ASM_RADR_UTRR_MASK                    (0x10000000U)
#define F16ASM_RADR_UTRR_SHIFT                   (28U)
#define F16ASM_RADR_UTRR_WIDTH                   (1U)
#define F16ASM_RADR_UTRR(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_RADR_UTRR_SHIFT)) & F16ASM_RADR_UTRR_MASK)
/*! @} */

/*! @name WADR - Write Address Logging */
/*! @{ */

#define F16ASM_WADR_WADDR_MASK                   (0x1FFFFE0U)
#define F16ASM_WADR_WADDR_SHIFT                  (5U)
#define F16ASM_WADR_WADDR_WIDTH                  (20U)
#define F16ASM_WADR_WADDR(x)                     (((uint32_t)(((uint32_t)(x)) << F16ASM_WADR_WADDR_SHIFT)) & F16ASM_WADR_WADDR_MASK)

#define F16ASM_WADR_WUL_MASK                     (0x2000000U)
#define F16ASM_WADR_WUL_SHIFT                    (25U)
#define F16ASM_WADR_WUL_WIDTH                    (1U)
#define F16ASM_WADR_WUL(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_WADR_WUL_SHIFT)) & F16ASM_WADR_WUL_MASK)

#define F16ASM_WADR_SPW_MASK                     (0x4000000U)
#define F16ASM_WADR_SPW_SHIFT                    (26U)
#define F16ASM_WADR_SPW_WIDTH                    (1U)
#define F16ASM_WADR_SPW(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_WADR_SPW_SHIFT)) & F16ASM_WADR_SPW_MASK)

#define F16ASM_WADR_OTPW_MASK                    (0x8000000U)
#define F16ASM_WADR_OTPW_SHIFT                   (27U)
#define F16ASM_WADR_OTPW_WIDTH                   (1U)
#define F16ASM_WADR_OTPW(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_WADR_OTPW_SHIFT)) & F16ASM_WADR_OTPW_MASK)

#define F16ASM_WADR_UTRW_MASK                    (0x10000000U)
#define F16ASM_WADR_UTRW_SHIFT                   (28U)
#define F16ASM_WADR_UTRW_WIDTH                   (1U)
#define F16ASM_WADR_UTRW(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_WADR_UTRW_SHIFT)) & F16ASM_WADR_UTRW_MASK)
/*! @} */

/*! @name LOCK0 - Partition Lock 0 */
/*! @{ */

#define F16ASM_LOCK0_LPLOCKL_MASK                (0xFFFFU)
#define F16ASM_LOCK0_LPLOCKL_SHIFT               (0U)
#define F16ASM_LOCK0_LPLOCKL_WIDTH               (16U)
#define F16ASM_LOCK0_LPLOCKL(x)                  (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK0_LPLOCKL_SHIFT)) & F16ASM_LOCK0_LPLOCKL_MASK)

#define F16ASM_LOCK0_LPLOCKU_MASK                (0xFFFF0000U)
#define F16ASM_LOCK0_LPLOCKU_SHIFT               (16U)
#define F16ASM_LOCK0_LPLOCKU_WIDTH               (16U)
#define F16ASM_LOCK0_LPLOCKU(x)                  (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK0_LPLOCKU_SHIFT)) & F16ASM_LOCK0_LPLOCKU_MASK)
/*! @} */

/*! @name LOCK1 - Partition Lock 1 */
/*! @{ */

#define F16ASM_LOCK1_SPLOCKL_MASK                (0x3U)
#define F16ASM_LOCK1_SPLOCKL_SHIFT               (0U)
#define F16ASM_LOCK1_SPLOCKL_WIDTH               (2U)
#define F16ASM_LOCK1_SPLOCKL(x)                  (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK1_SPLOCKL_SHIFT)) & F16ASM_LOCK1_SPLOCKL_MASK)

#define F16ASM_LOCK1_SPLOCKU_MASK                (0xCU)
#define F16ASM_LOCK1_SPLOCKU_SHIFT               (2U)
#define F16ASM_LOCK1_SPLOCKU_WIDTH               (2U)
#define F16ASM_LOCK1_SPLOCKU(x)                  (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK1_SPLOCKU_SHIFT)) & F16ASM_LOCK1_SPLOCKU_MASK)

#define F16ASM_LOCK1_OLOCKL_MASK                 (0x10U)
#define F16ASM_LOCK1_OLOCKL_SHIFT                (4U)
#define F16ASM_LOCK1_OLOCKL_WIDTH                (1U)
#define F16ASM_LOCK1_OLOCKL(x)                   (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK1_OLOCKL_SHIFT)) & F16ASM_LOCK1_OLOCKL_MASK)

#define F16ASM_LOCK1_OLOCKU_MASK                 (0x20U)
#define F16ASM_LOCK1_OLOCKU_SHIFT                (5U)
#define F16ASM_LOCK1_OLOCKU_WIDTH                (1U)
#define F16ASM_LOCK1_OLOCKU(x)                   (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK1_OLOCKU_SHIFT)) & F16ASM_LOCK1_OLOCKU_MASK)

#define F16ASM_LOCK1_UTLOCKL_MASK                (0x40U)
#define F16ASM_LOCK1_UTLOCKL_SHIFT               (6U)
#define F16ASM_LOCK1_UTLOCKL_WIDTH               (1U)
#define F16ASM_LOCK1_UTLOCKL(x)                  (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK1_UTLOCKL_SHIFT)) & F16ASM_LOCK1_UTLOCKL_MASK)

#define F16ASM_LOCK1_UTLOCKU_MASK                (0x80U)
#define F16ASM_LOCK1_UTLOCKU_SHIFT               (7U)
#define F16ASM_LOCK1_UTLOCKU_WIDTH               (1U)
#define F16ASM_LOCK1_UTLOCKU(x)                  (((uint32_t)(((uint32_t)(x)) << F16ASM_LOCK1_UTLOCKU_SHIFT)) & F16ASM_LOCK1_UTLOCKU_MASK)
/*! @} */

/*! @name UT0 - UTest 0 */
/*! @{ */

#define F16ASM_UT0_AID_MASK                      (0x1U)
#define F16ASM_UT0_AID_SHIFT                     (0U)
#define F16ASM_UT0_AID_WIDTH                     (1U)
#define F16ASM_UT0_AID(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AID_SHIFT)) & F16ASM_UT0_AID_MASK)

#define F16ASM_UT0_AIE_MASK                      (0x2U)
#define F16ASM_UT0_AIE_SHIFT                     (1U)
#define F16ASM_UT0_AIE_WIDTH                     (1U)
#define F16ASM_UT0_AIE(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AIE_SHIFT)) & F16ASM_UT0_AIE_MASK)

#define F16ASM_UT0_AIS_MASK                      (0x4U)
#define F16ASM_UT0_AIS_SHIFT                     (2U)
#define F16ASM_UT0_AIS_WIDTH                     (1U)
#define F16ASM_UT0_AIS(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AIS_SHIFT)) & F16ASM_UT0_AIS_MASK)

#define F16ASM_UT0_AISUS_MASK                    (0x40U)
#define F16ASM_UT0_AISUS_SHIFT                   (6U)
#define F16ASM_UT0_AISUS_WIDTH                   (1U)
#define F16ASM_UT0_AISUS(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AISUS_SHIFT)) & F16ASM_UT0_AISUS_MASK)

#define F16ASM_UT0_AIBPE_MASK                    (0x100U)
#define F16ASM_UT0_AIBPE_SHIFT                   (8U)
#define F16ASM_UT0_AIBPE_WIDTH                   (1U)
#define F16ASM_UT0_AIBPE(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AIBPE_SHIFT)) & F16ASM_UT0_AIBPE_MASK)

#define F16ASM_UT0_NAIBP_MASK                    (0x200U)
#define F16ASM_UT0_NAIBP_SHIFT                   (9U)
#define F16ASM_UT0_NAIBP_WIDTH                   (1U)
#define F16ASM_UT0_NAIBP(x)                      (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_NAIBP_SHIFT)) & F16ASM_UT0_NAIBP_MASK)

