zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_F16ASM.h
#define F16ASM_UT0_EIE_MASK                      (0x1000U)
#define F16ASM_UT0_EIE_SHIFT                     (12U)
#define F16ASM_UT0_EIE_WIDTH                     (1U)
#define F16ASM_UT0_EIE(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_EIE_SHIFT)) & F16ASM_UT0_EIE_MASK)

#define F16ASM_UT0_EDIE_MASK                     (0x2000U)
#define F16ASM_UT0_EDIE_SHIFT                    (13U)
#define F16ASM_UT0_EDIE_WIDTH                    (1U)
#define F16ASM_UT0_EDIE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_EDIE_SHIFT)) & F16ASM_UT0_EDIE_MASK)

#define F16ASM_UT0_AEIE_MASK                     (0x4000U)
#define F16ASM_UT0_AEIE_SHIFT                    (14U)
#define F16ASM_UT0_AEIE_WIDTH                    (1U)
#define F16ASM_UT0_AEIE(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AEIE_SHIFT)) & F16ASM_UT0_AEIE_MASK)

#define F16ASM_UT0_AILL_MASK                     (0x3000000U)
#define F16ASM_UT0_AILL_SHIFT                    (24U)
#define F16ASM_UT0_AILL_WIDTH                    (2U)
#define F16ASM_UT0_AILL(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AILL_SHIFT)) & F16ASM_UT0_AILL_MASK)

#define F16ASM_UT0_AILU_MASK                     (0xC000000U)
#define F16ASM_UT0_AILU_SHIFT                    (26U)
#define F16ASM_UT0_AILU_WIDTH                    (2U)
#define F16ASM_UT0_AILU(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_AILU_SHIFT)) & F16ASM_UT0_AILU_MASK)

#define F16ASM_UT0_FW_MASK                       (0x10000000U)
#define F16ASM_UT0_FW_SHIFT                      (28U)
#define F16ASM_UT0_FW_WIDTH                      (1U)
#define F16ASM_UT0_FW(x)                         (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_FW_SHIFT)) & F16ASM_UT0_FW_MASK)

#define F16ASM_UT0_RRE_MASK                      (0x40000000U)
#define F16ASM_UT0_RRE_SHIFT                     (30U)
#define F16ASM_UT0_RRE_WIDTH                     (1U)
#define F16ASM_UT0_RRE(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_RRE_SHIFT)) & F16ASM_UT0_RRE_MASK)

#define F16ASM_UT0_UTE_MASK                      (0x80000000U)
#define F16ASM_UT0_UTE_SHIFT                     (31U)
#define F16ASM_UT0_UTE_WIDTH                     (1U)
#define F16ASM_UT0_UTE(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_UT0_UTE_SHIFT)) & F16ASM_UT0_UTE_MASK)
/*! @} */

/*! @name UMISR - UTest Multiple Input Signature 0..UTest Multiple Input Signature 8 */
/*! @{ */

#define F16ASM_UMISR_MISR_MASK                   (0xFFFFFFFFU)
#define F16ASM_UMISR_MISR_SHIFT                  (0U)
#define F16ASM_UMISR_MISR_WIDTH                  (32U)
#define F16ASM_UMISR_MISR(x)                     (((uint32_t)(((uint32_t)(x)) << F16ASM_UMISR_MISR_SHIFT)) & F16ASM_UMISR_MISR_MASK)
/*! @} */

/*! @name UMISR9 - UTest Multiple Input Signature 9 */
/*! @{ */

#define F16ASM_UMISR9_MISR_MASK                  (0x1U)
#define F16ASM_UMISR9_MISR_SHIFT                 (0U)
#define F16ASM_UMISR9_MISR_WIDTH                 (1U)
#define F16ASM_UMISR9_MISR(x)                    (((uint32_t)(((uint32_t)(x)) << F16ASM_UMISR9_MISR_SHIFT)) & F16ASM_UMISR9_MISR_MASK)
/*! @} */

/*! @name UD_0_TO_7 - UTest Data 0..UTest Data 7 */
/*! @{ */

#define F16ASM_UD_0_TO_7_EDATA_MASK              (0xFFFFFFFFU)
#define F16ASM_UD_0_TO_7_EDATA_SHIFT             (0U)
#define F16ASM_UD_0_TO_7_EDATA_WIDTH             (32U)
#define F16ASM_UD_0_TO_7_EDATA(x)                (((uint32_t)(((uint32_t)(x)) << F16ASM_UD_0_TO_7_EDATA_SHIFT)) & F16ASM_UD_0_TO_7_EDATA_MASK)
/*! @} */

/*! @name UD8 - UTest Data 8 */
/*! @{ */

#define F16ASM_UD8_EDATAC_MASK                   (0xFFFFFFFU)
#define F16ASM_UD8_EDATAC_SHIFT                  (0U)
#define F16ASM_UD8_EDATAC_WIDTH                  (28U)
#define F16ASM_UD8_EDATAC(x)                     (((uint32_t)(((uint32_t)(x)) << F16ASM_UD8_EDATAC_SHIFT)) & F16ASM_UD8_EDATAC_MASK)
/*! @} */

/*! @name UD_9_TO_16 - UTest Data 9..UTest Data 16 */
/*! @{ */

#define F16ASM_UD_9_TO_16_EDDATA_MASK            (0xFFFFFFFFU)
#define F16ASM_UD_9_TO_16_EDDATA_SHIFT           (0U)
#define F16ASM_UD_9_TO_16_EDDATA_WIDTH           (32U)
#define F16ASM_UD_9_TO_16_EDDATA(x)              (((uint32_t)(((uint32_t)(x)) << F16ASM_UD_9_TO_16_EDDATA_SHIFT)) & F16ASM_UD_9_TO_16_EDDATA_MASK)
/*! @} */

/*! @name UD17 - UTest Data 17 */
/*! @{ */

#define F16ASM_UD17_EDDATAC_MASK                 (0xFFFFFFFU)
#define F16ASM_UD17_EDDATAC_SHIFT                (0U)
#define F16ASM_UD17_EDDATAC_WIDTH                (28U)
#define F16ASM_UD17_EDDATAC(x)                   (((uint32_t)(((uint32_t)(x)) << F16ASM_UD17_EDDATAC_SHIFT)) & F16ASM_UD17_EDDATAC_MASK)
/*! @} */

/*! @name UA0 - UTest Address 0 */
/*! @{ */

#define F16ASM_UA0_AEI_MASK                      (0xFFFFFFU)
#define F16ASM_UA0_AEI_SHIFT                     (0U)
#define F16ASM_UA0_AEI_WIDTH                     (24U)
#define F16ASM_UA0_AEI(x)                        (((uint32_t)(((uint32_t)(x)) << F16ASM_UA0_AEI_SHIFT)) & F16ASM_UA0_AEI_MASK)

#define F16ASM_UA0_AEIS_MASK                     (0xF0000000U)
#define F16ASM_UA0_AEIS_SHIFT                    (28U)
#define F16ASM_UA0_AEIS_WIDTH                    (4U)
#define F16ASM_UA0_AEIS(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_UA0_AEIS_SHIFT)) & F16ASM_UA0_AEIS_MASK)
/*! @} */

/*! @name UA1 - UTest Address 1 */
/*! @{ */

#define F16ASM_UA1_AEIO_MASK                     (0x7FFFFFU)
#define F16ASM_UA1_AEIO_SHIFT                    (0U)
#define F16ASM_UA1_AEIO_WIDTH                    (23U)
#define F16ASM_UA1_AEIO(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_UA1_AEIO_SHIFT)) & F16ASM_UA1_AEIO_MASK)

#define F16ASM_UA1_AEIC_MASK                     (0xFF000000U)
#define F16ASM_UA1_AEIC_SHIFT                    (24U)
#define F16ASM_UA1_AEIC_WIDTH                    (8U)
#define F16ASM_UA1_AEIC(x)                       (((uint32_t)(((uint32_t)(x)) << F16ASM_UA1_AEIC_SHIFT)) & F16ASM_UA1_AEIC_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group F16ASM_Register_Masks */

/*!
 * @}
 */ /* end of group F16ASM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_F16ASM_H_) */
